/**
 * Copyright (c) 2011-2014, James Zhan 詹波 (jfinal@126.com).
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 */

package com.yonyou.nccloud.weixin.sdk.api;

import java.util.HashMap;
import java.util.Map;

/**
 * 微信接口全局返回码
 */
public class ReturnCode {

  @SuppressWarnings("serial")
  private static final Map<Integer, String> errCodeToErrMsg = new HashMap<Integer, String>() {
    {
      put(-1, "系统繁忙");
      put(0, "请求成功");
      put(40001, "获取access_token时AppSecret错误，或者access_token无效");
      put(40002, "不合法的凭证类型");
      put(40003, "不合法的OpenID");
      put(40004, "不合法的媒体文件类型");
      put(40005, "不合法的文件类型");
      put(40006, "不合法的文件大小");
      put(40007, "不合法的媒体文件id");
      put(40008, "不合法的消息类型");
      put(40009, "不合法的图片文件大小");
      put(40010, "不合法的语音文件大小");
      put(40011, "不合法的视频文件大小");
      put(40012, "不合法的缩略图文件大小");
      put(40013, "不合法的APPID");
      put(40014, "不合法的access_token");
      put(40015, "不合法的菜单类型");
      put(40016, "不合法的按钮个数");
      put(40017, "不合法的按钮个数");
      put(40018, "不合法的按钮名字长度");
      put(40019, "不合法的按钮KEY长度");
      put(40020, "不合法的按钮URL长度");
      put(40021, "不合法的菜单版本号");
      put(40022, "不合法的子菜单级数");
      put(40023, "不合法的子菜单按钮个数");
      put(40024, "不合法的子菜单按钮类型");
      put(40025, "不合法的子菜单按钮名字长度");
      put(40026, "不合法的子菜单按钮KEY长度");
      put(40027, "不合法的子菜单按钮URL长度");
      put(40028, "不合法的自定义菜单使用用户");
      put(40029, "不合法的oauth_code");
      put(40030, "不合法的refresh_token");
      put(40031, "不合法的openid列表");
      put(40032, "不合法的openid列表长度");
      put(40033, "不合法的请求字符，不能包含\\uxxxx格式的字符");
      put(40035, "不合法的参数");
      put(40038, "不合法的请求格式");
      put(40039, "不合法的URL长度");
      put(40050, "不合法的分组id");
      put(40051, "分组名字不合法");
      put(41001, "缺少access_token参数");
      put(41002, "缺少appid参数");
      put(41003, "缺少refresh_token参数");
      put(41004, "缺少secret参数");
      put(41005, "缺少多媒体文件数据");
      put(41006, "缺少media_id参数");
      put(41007, "缺少子菜单数据");
      put(41008, "缺少oauth code");
      put(41009, "缺少openid");
      put(42001, "access_token超时");
      put(42002, "refresh_token超时");
      put(42003, "oauth_code超时");
      put(43001, "需要GET请求");
      put(43002, "需要POST请求");
      put(43003, "需要HTTPS请求");
      put(43004, "需要接收者关注");
      put(43005, "需要好友关系");
      put(44001, "多媒体文件为空");
      put(44002, "POST的数据包为空");
      put(44003, "图文消息内容为空");
      put(44004, "文本消息内容为空");
      put(45001, "多媒体文件大小超过限制");
      put(45002, "消息内容超过限制");
      put(45003, "标题字段超过限制");
      put(45004, "描述字段超过限制");
      put(45005, "链接字段超过限制");
      put(45006, "图片链接字段超过限制");
      put(45007, "语音播放时间超过限制");
      put(45008, "图文消息超过限制");
      put(45009, "接口调用超过限制");
      put(45010, "创建菜单个数超过限制");
      put(45015, "回复时间超过限制");
      put(45016, "系统分组，不允许修改");
      put(45017, "分组名字过长");
      put(45018, "分组数量超过上限");
      put(46001, "不存在媒体数据");
      put(46002, "不存在的菜单版本");
      put(46003, "不存在的菜单数据");
      put(46004, "不存在的用户");
      put(47001, "解析JSON/XML内容错误");
      put(48001, "api功能未授权");
      put(50001, "用户未授权该api");
      put(50002, "成员不在权限范围");
      put(50003, "应用已停用");
      put(50004, "成员状态不正确，需要成员为企业验证中状态");
      put(50005, "企业已禁用");
      put(60001, "部门长度不符合限制");
      put(60002, "部门层级深度超过限制");
      put(60003, "部门不存在");
      put(60004, "父亲部门不存在");
      put(60005, "不允许删除有成员的部门");
      put(60006, "不允许删除有子部门的部门");
      put(60007, "不允许删除根部门");
      put(60008, "部门名称已存在");
      put(60009, "部门名称含有非法字符");
      put(60010, "部门存在循环关系");
      put(60011, "管理组权限不足，（user/department/agent）无权限");
      put(60012, "不允许删除默认应用");
      put(60013, "不允许关闭应用");
      put(60014, "不允许开启应用");
      put(60015, "不允许修改默认应用可见范围");
      put(60016, "不允许删除存在成员的标签");
      put(60017, "不允许设置企业");
      put(60019, "不允许设置应用地理位置上报开关");
      put(60020, "访问ip不在白名单之中");
      put(60025, "主页型应用不支持的消息类型");
      put(60027, "不支持第三方修改主页型应用字段");
      put(60028, "应用已授权予第三方，不允许通过接口修改主页url");
      put(60029, "应用已授权予第三方，不允许通过接口修改可信域名");
      put(60102, "UserID已存在");
      put(60103, "手机号码不合法");
      put(60104, "手机号码已存在");
      put(60105, "邮箱不合法");
      put(60106, "邮箱已存在");
      put(60107, "微信号不合法");
      put(60108, "微信号已存在");
      put(60109, "QQ号已存在");
      put(60110, "用户同时归属部门超过20个");
      put(60111, "UserID不存在");
      put(60112, "成员姓名不合法");
      put(60113, "身份认证信息（微信号/手机/邮箱）不能同时为空");
      put(60114, "性别不合法");
      put(60115, "已关注成员微信不能修改");
      put(60116, "扩展属性已存在");
      put(60118, "成员无有效邀请字段，详情参考(邀请成员关注)的接口说明");
      put(60119, "成员已关注");
      put(60120, "成员已禁用");
      put(60121, "找不到该成员");
      put(60122, "邮箱已被外部管理员使用");
      put(60123, "无效的部门id");
      put(60124, "无效的父部门id");
      put(60125, "非法部门名字，长度超过限制、重名等");
      put(60126, "创建部门失败");
      put(60127, "缺少部门id");
      put(60128, "字段不合法，可能存在主键冲突或者格式错误");
      put(60129, "用户设置了拒绝邀请");
      put(80001, "可信域名不匹配，或者可信域名没有IPC备案（后续将不能在该域名下正常使用jssdk）");
      put(81003, "邀请额度已用完");
      put(81004, "部门数量超过上限");
      put(82001, "发送消息或者邀请的参数全部为空或者全部不合法");
      put(82002, "不合法的PartyID列表长度");
      put(82003, "不合法的TagID列表长度");
      put(82004, "微信版本号过低");
      put(85002, "包含不合法的词语");
      put(86001, "不合法的会话ID");
      put(86003, "不存在的会话ID");
      put(86004, "不合法的会话名");
      put(86005, "不合法的会话管理员");
      put(86006, "不合法的成员列表大小");
      put(86007, "不存在的成员");
      put(86101, "需要会话管理员权限");
      put(86201, "缺少会话ID");
      put(86202, "缺少会话名");
      put(86203, "缺少会话管理员");
      put(86204, "缺少成员");
      put(86205, "非法的会话ID长度");
      put(86206, "非法的会话ID数值");
      put(86207, "会话管理员不在用户列表中");
      put(86208, "消息服务未开启");
      put(86209, "缺少操作者");
      put(86210, "缺少会话参数");
      put(86211, "缺少会话类型（单聊或者群聊）");
      put(86213, "缺少发件人");
      put(86214, "非法的会话类型");
      put(86215, "会话已存在");
      put(86216, "非法会话成员");
      put(86217, "会话操作者不在成员列表中");
      put(86218, "非法会话发件人");
      put(86219, "非法会话收件人");
      put(86220, "非法会话操作者");
      put(86221, "单聊模式下，发件人与收件人不能为同一人");
      put(86222, "不允许消息服务访问的API");
      put(86304, "不合法的消息类型");
      put(86305, "客服服务未启用");
      put(86306, "缺少发送人");
      put(86307, "缺少发送人类型");
      put(86308, "缺少发送人id");
      put(86309, "缺少接收人");
      put(86310, "缺少接收人类型");
      put(86311, "缺少接收人id");
      put(86312, "缺少消息类型");
      put(86313, "缺少客服，发送人或接收人类型，必须有一个为kf");
      put(86314, "客服不唯一，发送人或接收人类型，必须只有一个为kf");
      put(86315, "不合法的发送人类型");
      put(86316, "不合法的发送人id。Userid不存在、openid不存在、kf不存在");
      put(86317, "不合法的接收人类型");
      put(86318, "不合法的接收人id。Userid不存在、openid不存在、kf不存在");
      put(86319, "不合法的客服，kf不在客服列表中");
      put(86320, "不合法的客服类型");
      put(90001, "未认证摇一摇周边");
      put(90002, "缺少摇一摇周边ticket参数");
      put(90003, "摇一摇周边ticket参数不合法");
      put(90004, "摇一摇周边ticket过期");
      put(90005, "未开启摇一摇周边服务");
    }
  };

  /**
   * 通过返回码获取返回信息
   */
  public static String get(int errCode) {
    String result = errCodeToErrMsg.get(errCode);
    return result != null ? result : "未知返回码：" + errCode;
  }
}
